R_rheo_final/run2/constant/solidificationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidificationProperties;
}

Tsolid      273.15;                       // [K]
Tliquid     273.65;                       // [K]
Tref        273.15;                       // [K]
Treg        275.15;                       // [K]
latentHeat  300e3;                       // [J/kg]

water
{
    rho               1100;
    rhoLiquid         1100;                 // [kg/m^3]
    rhoSolid          980;                  // [kg/m^3]
    cpLiquid          3500;                 // [J/(kg*K)]
    cpSolid           2000;                 // [J/(kg*K)]


    lambda            0.6;                // [W/(m*K)]
    lambdaSolid       2.26;                // [W/(m*K)]
    lambdaLiquid      0.6;                // [W/(m*K)]
}

contactFluid
{
    rho           1732.52;                   // [kg/m^3]    
    cp            1250;                   // [J/(kg*K)] 
    lambda        0.5;                   // [W/(m*K)]  
}

air
{
    rho          1.2;                     // [kg/m^3]
    cp           1005;                    // [J/(kg*K)]
    lambda       0.03;                    // [W/(m*K)]
}
heatTransfer
{
    // water - contactFluid
    K_wc    3e6;                          // [W/(m^3*K)] = 112 W/(m^2*K) Mesh (400 x 1 x 400) 

    // water - air
    K_wa    2e5;                          // [W/(m^3*K)] = 7,5 W/(m^2*K) Mesh (400 x 1 x 400)

    // contactFluid - air
    K_ca    0;                            // [W/(m^3*K)]
}

